experiments/results/thesis/host-NFS-Ceph/MT_8/fio_randread_64k_128_1_5.out
"randread_64k_128_1": (g=0): rw=randread, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=io_uring, iodepth=128
fio-3.28
Starting 1 thread

"randread_64k_128_1": (groupid=0, jobs=1): err= 0: pid=82955: Wed Aug  9 00:22:17 2023
  read: IOPS=2401, BW=150MiB/s (157MB/s)(9023MiB/60073msec)
    slat (usec): min=5, max=210, avg= 9.18, stdev= 1.89
    clat (msec): min=36, max=124, avg=53.27, stdev= 9.83
     lat (msec): min=36, max=124, avg=53.28, stdev= 9.83
    clat percentiles (msec):
     |  1.00th=[   40],  5.00th=[   41], 10.00th=[   42], 20.00th=[   44],
     | 30.00th=[   45], 40.00th=[   48], 50.00th=[   54], 60.00th=[   57],
     | 70.00th=[   61], 80.00th=[   64], 90.00th=[   67], 95.00th=[   69],
     | 99.00th=[   73], 99.50th=[   74], 99.90th=[   79], 99.95th=[   94],
     | 99.99th=[  121]
   bw (  KiB/s): min=116480, max=195968, per=100.00%, avg=153873.04, stdev=25258.38, samples=120
   iops        : min= 1820, max= 3062, avg=2404.23, stdev=394.66, samples=120
  lat (msec)   : 50=44.10%, 100=55.94%, 250=0.04%
  cpu          : usr=0.98%, sys=2.84%, ctx=144444, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=144242,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=150MiB/s (157MB/s), 150MiB/s-150MiB/s (157MB/s-157MB/s), io=9023MiB (9461MB), run=60073-60073msec