experiments/results/thesis/host-NFS-Ceph/MT_8/fio_randwrite_64k_1_1_5.out
"randwrite_64k_1_1": (g=0): rw=randwrite, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=io_uring, iodepth=1
fio-3.28
Starting 1 thread

"randwrite_64k_1_1": (groupid=0, jobs=1): err= 0: pid=85025: Wed Aug  9 00:58:37 2023
  write: IOPS=565, BW=35.4MiB/s (37.1MB/s)(2122MiB/60002msec); 0 zone resets
    slat (usec): min=10, max=126, avg=13.92, stdev= 3.43
    clat (usec): min=1033, max=52486, avg=1751.02, stdev=798.10
     lat (usec): min=1049, max=52502, avg=1765.17, stdev=798.08
    clat percentiles (usec):
     |  1.00th=[ 1188],  5.00th=[ 1287], 10.00th=[ 1352], 20.00th=[ 1434],
     | 30.00th=[ 1483], 40.00th=[ 1549], 50.00th=[ 1614], 60.00th=[ 1696],
     | 70.00th=[ 1778], 80.00th=[ 1942], 90.00th=[ 2278], 95.00th=[ 2606],
     | 99.00th=[ 3490], 99.50th=[ 4047], 99.90th=[11600], 99.95th=[16319],
     | 99.99th=[32375]
   bw (  KiB/s): min=29056, max=40704, per=100.00%, avg=36215.16, stdev=2102.93, samples=120
   iops        : min=  454, max=  636, avg=565.85, stdev=32.88, samples=120
  lat (msec)   : 2=82.80%, 4=16.67%, 10=0.42%, 20=0.08%, 50=0.04%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.33%, sys=0.96%, ctx=34188, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,33951,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=35.4MiB/s (37.1MB/s), 35.4MiB/s-35.4MiB/s (37.1MB/s-37.1MB/s), io=2122MiB (2225MB), run=60002-60002msec